Repository: jhedstrom/drupalextension
Catalog: i18n/*.xliff
Languages: es, fr

source: I am an anonymous user
fr: /^(?:Soit|(?:Que |)je suis) (?:un utilisateur |)anonyme$/i

source: I am not logged in
fr: /^(?:Ne soit pas|(?:Que |)je ne suis pas) connecté$/i

source: I am logged in as a user with the :role role(s)
fr: /^(?:|(?:Que |)je )suis connecté (?:en tant qu’utilisateur |)avec le(?:s|) role(?:s|) "(?P<role>(?:[^"]|\\")*)"$/i

source: I am logged in as :name
fr: /^(?:(?:Que |)je |)suis connecté tant (?:que|qu') "(?P<name>(?:[^"]|\\")*)"$/i

source: I am logged in as a user with the :permissions permission(s)
fr: /^(?:(?:Que |)je |)suis connecté en tant qu’utilisateur avec (?:la|les) permission(?:s|) "(?P<permissions>(?:[^"]|\\")*)"$/i

source: I should see (the text ):text in the ":rowText" row
fr: /^(?:je |)devrais voir (?:le texte |)"(?P<text>(?:[^"]|\\")*)" à la ligne "(?P<rowText>(?:[^"]|\\")*)"$/i

source: I click :link in the :rowText row
fr: /^(?:(?:Que |)je |)clique sur (?:le lien |)"(?P<link>(?:[^"]|\\")*)" à la ligne "(?P<rowText>(?:[^"]|\\")*)"$/i

source: I (should )see the :link in the :rowText row
fr: /^(?:je |)(?:devrais voir|vois) le lien "(?P<link>(?:[^"]|\\")*)" à la ligne "(?P<rowText>(?:[^"]|\\")*)"$/i

source: the cache has been cleared
fr: /^(?:Que )le cache a été (?:vidé|effacé|supprimé)$/i

source: I run cron
fr: /^(?:J’|)exécute (?:un cron|une tâche planifiée)$/i

source: I am viewing a/an :type (content )with the title :title
fr: /^(?:J’|)ai consulté (?:un|une) (?:contenu de type |)"(?P<type>(?:[^"]|\\")*)" avec le titre "(?P<title>(?:[^"]|\\")*)"$/i

source: a/an :type (content )with the title :title
fr: /^(?:un|une) (?:contenu de type |)"(?P<type>(?:[^"]|\\")*)" avec le titre "(?P<title>(?:[^"]|\\")*)"$/i

source: I am viewing my :type (content )with the title :title
fr: /^(?:(?:Que |)j'|)affiche (?:un|une) (?:contenu de type |)"(?P<type>(?:[^"]|\\")*)" avec le titre "(?P<title>(?:[^"]|\\")*)"$/i

source: :type content:
fr: /^contenu (?:de type |)"(?P<type>(?:[^"]|\\")*)"$/i

source: I am viewing a/an :type( content):
fr: /^(?:(?:Que |)J’|)affiche (?:un|une) (?:type de contenu |)"(?P<type>(?:[^"]|\\")*)"<$/i

source: I should be able to edit a/an :type( content)
fr: /^(?:je|)devrais être en mesure de modifier (?:un|une) (?:type de contenu |)"(?P<type>(?:[^"]|\\")*)"$/i

source: I am viewing a/an :vocabulary term with the name :name
fr: /^(?:(?:Que |)j'|)affiche le terme "(?P<name>(?:[^"]|\\")*)" du vocabulaire "(?P<vocabulary>(?:[^"]|\\")*)"$/i

source: a/an :vocabulary term with the name :name
fr: /^le terme "(?P<name>(?:[^"]|\\")*)" du vocabulaire "(?P<vocabulary>(?:[^"]|\\")*)"$/i

source: users:
fr: /^utilisateurs :$/i

source: :vocabulary terms:
fr: /^termes du vocabulaire "(?P<vocabulary>(?:[^"]|\\")*)"$/i

source: (I )break
fr: /^(?:(?:Que |)je |)fais une pause$/i

source: I run drush :command
fr: /^(?:(?:Que |)je |)lance la commande drush (?P<command>.*)/

source: I run drush :command :arguments
fr: /^(?:(?:Que |)je |)lance la commande drush (?P<command>[^ ]+) (?P<arguments>.*)$/i

source: drush output should contain :output
fr: /^Drush doit afficher "(?P<output>(?:[^"]|\\")*)"$/i

source: drush output should not contain :output
fr: /^Drush ne doit pas afficher "(?P<output>(?:[^"]|\\")*)"$/i

source: print last drush output
fr: /^(?:je devrais voir|Affiche) le résulat de Drush$/i

source: I should see the error message( containing) :message
fr: /^(?:je devrais voir|Affiche) (?:le|un) message d’erreur (?:contenant |)"(?P<message>(?:[^"]|\\")*)"$/i

source: I should see the following error message(s):
fr: /^(?:je devrais voir|Affiche) le(?:s|) message(?:s|) d’erreur suivants :$/i

source: I should not see the error message( containing) :message
fr: /^(?:je ne devrais pas voir|N'affiche pas) (?:le|un) message d’erreur (?:contenant |)"(?P<message>(?:[^"]|\\")*)"$/i

source: I should not see the following error messages:
fr: /^(?:je ne devrais pas voir|N'affiche pas) les messages d’erreur suivants :$/i

source: I should see the success message( containing) :message
fr: /^(?:je devrais voir|Affiche) (?:le|un) message de réussite (?:contenant |)"(?P<message>(?:[^"]|\\")*)"$/i

source: I should see the following success messages:
fr: /^(?:je devrais voir|Affiche) les messages de succès suivants :$/i

source: I should not see the success message( containing) :message
fr: /^(?:je ne devrais pas voir|N'affiche pas) (?:le|un) message de réussite (?:contenant |)"(?P<message>(?:[^"]|\\")*)"$/i

source: I should not see the following success messages:
fr: /^(?:je ne devrais pas voir|N'affiche pas) les messages de succès suivants :$/i

source: I should see the warning message( containing) :message
fr: /^(?:je devrais voir|Affiche) (?:le|un) message d’avertissement (?:contenant |)"(?P<message>(?:[^"]|\\")*)"$/i

source: I should see the following warning messages:
fr: /^(?:je devrais voir|Affiche) les messages d’avertissement suivants :$/i

source: I should not see the warning message( containing) :message
fr: /^(?:je ne devrais pas voir|N'affiche pas) (?:le|un) message d’avertissement (?:contenant |)"(?P<message>(?:[^"]|\\")*)"$/i

source: I should not see the following warning messages:
fr: /^(?:je ne devrais pas voir|N'affiche pas) les messages d’avertissement suivants :$/i

source: I should see the message( containing) :message
fr: /^(?:je devrais voir|Affiche) (?:le|un) message (?:contenant |)"(?P<message>(?:[^"]|\\")*)"$/i

source: I should not see the message( containing) :message
fr: /^(?:je ne devrais pas voir|N'affiche pas) le message (?:contenant |)"(?P<message>(?:[^"]|\\")*)"$/i

source: I am at :path
fr: /^(?:(?:Que |)je suis|Sois) (?:à l'adresse |à |à la page )"(?P<path>(?:[^"]|\\")*)"$/i

source: I visit :path
fr: /^(?:(?:Que |)je me rends|Rends toi) à (?:l'adresse |)"(?P<path>(?:[^"]|\\")*)"$/i

source: I click :link
fr: /^(?:(?:Que |)je |)clique sur (?:le lien |)"(?P<link>(?:[^"]|\\")*)"$/i

source: for :field I enter :value
fr: /^dans (?:le champ |)"(?P<field>(?:[^"]|\\")*)", je saisis "(?P<value>(?:[^"]|\\")*)"$/i

source: I enter :value for :field
fr: /^(?:(?:Que |)je |)saisis "(?P<value>(?:[^"]|\\")*)" dans (?:le champ |)"(?P<field>(?:[^"]|\\")*)"$/i

source: I wait for AJAX to finish
fr: /^(?:(?:Que |)J’|)attends la fin de la requête AJAX$/i

source: I press the :button button
fr: /^(?:(?:Que |)je |)clique sur le bouton "(?P<button>(?:[^"]|\\")*)"$/i

source: I press the :char key in the :field field
fr: /^(?:(?:Que |)j'|)appuie sur (?:la touche |)"(?P<char>(?:[^"]|\\")*)" dans (?:le champ |)"(?P<field>(?:[^"]|\\")*)"$/i

source: I should see the link :link
fr: /^(?:je devrais voir|Affiche) le lien "(?P<link>(?:[^"]|\\")*)"$/i

source: I should not see the link :link
fr: /^(?:je ne devrais pas voir|N'affiche pas) le lien "(?P<link>(?:[^"]|\\")*)"$/i

source: I (should )see the heading :heading
fr: /^(?:je devrais voir|Affiche) le titre "(?P<heading>(?:[^"]|\\")*)"$/i

source: I (should )not see the heading :heading
fr: /^(?:je ne devrais pas voir|N'affiche pas) le titre "(?P<heading>(?:[^"]|\\")*)"$/i

source: I should see the heading :heading in the :region( region)
fr: /^(?:je devrais voir|Affiche) le titre "(?P<heading>(?:[^"]|\\")*)" dans (?:la région |la |le |l')"(?P<region>(?:[^"]|\\")*)"$/i

# i-should-see-the-heading-heading-in-the-region-region-1
source: I should see the :heading heading in the :region( region)
fr: /^(?:je devrais voir|Affiche) le titre "(?P<heading>(?:[^"]|\\")*)" dans (?:la région |la |le |l')"(?P<region>(?:[^"]|\\")*)"$/i

source: I follow/click :link in the :region( region)
fr: /^(?:j'ai suivi|(?:Que |)j'ai cliqué|Clique) sur (?:le lien |)(?P<link>[^ ]+) dans (?:la région |la |le |l')"(?P<region>(?:[^"]|\\")*)"$/i

source: I should see the link :link in the :region( region)
fr: /^(?:je devrais voir|Affiche) le lien "(?P<link>(?:[^"]|\\")*)" dans (?:la région |la |le |l')"(?P<region>(?:[^"]|\\")*)"$/i

source: I should not see the link :link in the :region( region)
fr: /^(?:je ne devrais pas voir|N'affiche pas) le lien "(?P<link>(?:[^"]|\\")*)" dans (?:la région |la |le |l')"(?P<region>(?:[^"]|\\")*)"$/i

source: I should see( the text) :text in the :region( region)
fr: /^(?:je devrais voir|Affiche) (?:le texte |)"(?P<text>(?:[^"]|\\")*)" dans (?:la région |la |le |l')"(?P<region>(?:[^"]|\\")*)"$/i

source: I should not see( the text) :text in the :region( region)
fr: /^(?:je ne devrais pas voir|N'affiche pas) (?:le texte |)"(?P<text>(?:[^"]|\\")*)" dans (?:la région |la |le |l')"(?P<region>(?:[^"]|\\")*)"$/i

source: I press :button in the :region( region)
fr: /^(?:(?:Que |)j'|)appuie sur (?:le bouton )"(?P<button>(?:[^"]|\\")*)" dans (?:la région |la |le |l')"(?P<region>(?:[^"]|\\")*)"$/i

source: I fill in :value for :field in the :region( region)
fr: /^(?:(?:Que |)je |)saisis (?:la valeur |)"(?P<value>(?:[^"]|\\")*)" dans (?:la région |la |le |l')"(?P<region>(?:[^"]|\\")*)"$/i

source: I fill in :field with :value in the :region( region)
fr: /^(?:(?:Que |)je |)saisis (?:la valeur |)"(?P<value>(?:[^"]|\\")*)" dans le champ "(?P<field>(?:[^"]|\\")*)" (?:de la région |de la |du )"(?P<region>(?:[^"]|\\")*)"$/i

source: I (should )see the text :text
fr: /^(?:je devrais voir|Affiche) (?:le texte |)"(?P<text>(?:[^"]|\\")*)"$/i

source: I should not see the text :text
fr: /^(?:je ne devrais pas voir|N'affiche pas) (?:le texte |)"(?P<text>(?:[^"]|\\")*)"$/i

source: I should get a :code HTTP response
fr: /^(?:je devrais avoir|A) le code (?:HTTP |)"(?P<text>(?:[^"]|\\")*)"$/i

source: I should not get a :code HTTP response
fr: /^(?:je ne devrais pas avoir|N'a pas) le code (?:HTTP |)"(?P<text>(?:[^"]|\\")*)"$/i

source: I check the box :checkbox
fr: /^(?:(?:Que |)je |)coche la case "(?P<checkbox>(?:[^"]|\\")*)"$/i

source: I uncheck the box :checkbox
fr: /^(?:(?:Que |)je |)décoche la case "(?P<checkbox>(?:[^"]|\\")*)"$/i

source: I select the radio button :label with the id :id
fr: /^(?:(?:Que |)je |)sélectionne le bouton radio "(?P<label>(?:[^"]|\\")*)" avec l'ID "(?P<id>(?:[^"]|\\")*)"$/i

source: I select the radio button :label
fr: /^(?:(?:Que |)je |)sélectionne le bouton radio "(?P<label>(?:[^"]|\\")*)"$/i

source: I am an anonymous user
es: (que )soy un usuario anónimo

source: I am not logged in
es: (que )no estoy conectado

source: I am logged in as a user with the :role role(s)
es: (que )estoy conectado como usuario con rol(es) :role

source: I am logged in as :name
es: (que )estoy conectado como :name

source: I am logged in as a user with the :permissions permission(s)
es: (que )estoy conectado com un usuario con permiso(s) :permissions

source: I should see (the text ):text in the ":rowText" row
es: debo ver (el texto ):text en la fila ":rowText"

source: I click :link in the :rowText row
es: hago click en el enlace :link de la fila :rowText

source: I (should )see the :link in the :rowText row
es: debo ver el enlace :link de la fila :rowText

source: the cache has been cleared
es: la cache ha sido limpiada

source: I run cron
es: lanzo el cron

source: I am viewing a/an :type (content )with the title :title
es: (que )estoy viendo un contenido de tipo :type con el título :title

source: a/an :type (content )with the title :title
es: un contenido de tipo :type con el título :title

source: I am viewing my :type (content )with the title :title
es: (que )estoy viendo mi contenido de tipo :type con el título :title

source: :type content:
es: :type con contenido:

source: I am viewing a/an :type( content):
es: (que )veo un(a) :type( con contenido):

source: I should be able to edit a/an :type( content)
es: debo poder editar un contenido de tipo :type

source: I am viewing a/an :vocabulary term with the name :name
es: (que )estoy viendo un término de :vocabulary con el nombre :name

source: a/an :vocabulary term with the name :name
es: un término de :vocabulary con el nombre :name

source: :vocabulary terms:
es: :vocabulary términos:

source: (I )break
es: break

source: I run drush :command
es: ejecuto el comando drush :command

source: I run drush :command :arguments
es: ejecuto el comando drush :command :arguments

source: drush output should contain :output
es: la salidad de drush debe contener :output

source: drush output should not contain :output
es: la salidad de drush no debe contener :output

source: print last drush output
es: imprime la última salida de drush

source: I should see the error message( containing) :message
es: debo ver un mensaje de error( conteniendo) :message

source: I should see the following error message(s):
es: debo ver los siguientes mensajes de error:

source: I should not see the error message( containing) :message
es: no debo ver un mensaje de error( conteniendo) :message

source: I should not see the following error messages:
es: no debo ver los siguientes mensajes de error:

source: I should see the success message( containing) :message
es: debo ver el mensaje de confirmación( conteniendo) :message

source: I should see the following success messages:
es: debo ver los mensajes de siguientes mensajes de confirmación:

source: I should not see the success message( containing) :message
es: no debo ver el mensaje de confirmación( conteniendo) :message

source: I should not see the following success messages:
es: no debo ver los mensajes de siguientes mensajes de confirmación:

source: I should see the warning message( containing) :message
es: debo ver el mensaje de aviso( conteniendo) :message

source: I should see the following warning messages:
es: debo ver los mensajes de siguientes mensajes de aviso:

source: I should not see the warning message( containing) :message
es: no debo ver el mensaje de aviso( conteniendo) :message

source: I should not see the following warning messages:
es: no debo ver los mensajes de siguientes mensajes de confirmación:

source: I should see the message( containing) :message
es: debo ver el mensaje( conteniendo) :message

source: I should not see the message( containing) :message
es: no debo ver el mensaje( conteniendo) :message

source: I am at :path
es: (que )estoy en :path

source: I visit :path
es: visito :path

source: I click :link
es: hago click en :link

source: for :field I enter :value
es: para el campo :field introduzco( el valor) :value

source: I enter :value for :field
es: introduzco( el valor) :value para el campo :field

source: I wait for AJAX to finish
es: espero a que AJAX termine

source: I press the :button button
es: pulso el botón :button

source: I press the :char key in the :field field
es: pulso la tecla :char en el campo :field

source: I should see the link :link
es: debo ver el enlace :link

source: I should not see the link :link
es: no debo ver el enlace :link

source: I (should )see the heading :heading
es: debo ver el encabezado :heading

source: I (should )not see the heading :heading
es: no debo ver el encabezado :heading

source: I should see the heading :heading in the :region( region)
es: debo ver el encabezado :heading en( la zona) :region

# i-should-see-the-heading-heading-in-the-region-region-1
source: I should see the :heading heading in the :region( region)
es: debo ver :heading como encabezado en( la zona) :region

source: I follow/click :link in the :region( region)
es: hago click en :link de( la zona) :region

source: I should see the link :link in the :region( region)
es: debo ver el enlace :link en( la zona) :region

source: I should not see the link :link in the :region( region)
es: no debo ver el enlace :link en( la zona) :region

source: I should see( the text) :text in the :region( region)
es: debo ver( el texto) :text en( la zona) :region

source: I should not see( the text) :text in the :region( region)
es: no debo ver( el texto) :text en( la zona) :region

source: I press :button in the :region( region)
es: pulso( el botón) :button en( la zona) :region

source: I fill in :value for :field in the :region( region)
es: relleno con :value el campo :field en( la zona) :region

source: I fill in :field with :value in the :region( region)
es: relleno el campo :field con :value en( la zona) :region

source: I (should )see the text :text
es: debo ver el texto :text

source: I should not see the text :text
es: no debo ver el texto :text

source: I should get a :code HTTP response
es: debo obtener una respuesta HTTP( con) código :code

source: I should not get a :code HTTP response
es: no debo obtener una respuesta HTTP( con) código :code

source: I check the box :checkbox
es: marco la opción :checkbox

source: I uncheck the box :checkbox
es: desmarco la opción :checkbox

source: I select the radio button :label with the id :id
es: selecciono el botón de radio :label con el id :id

source: I select the radio button :label
es: selecciono el botón de radio :label
